# 3) Выведите количество слов в строке

a = (input('Введите строку: '))

print(f'Количество слов в строке: {len(a.split())}')