# 11) Дан словарь:
date_dict = {'year': 2024, 'month': 4, 'day': 14}

# Выведите результат: '2024-4-14'

print(f'{date_dict["year"]}-{date_dict["month"]}-{date_dict["day"]}')
